doc/s-sql-b.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-12 Tue 18:59 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>S-SQL Examples B</title>
<meta name="author" content="Sabra Crolleton" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">S-SQL Examples B</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1e71f97">S-SQL Examples Home Page</a></li>
<li><a href="#between">Between</a></li>
<li><a href="#boolean">Boolean Operators (:is-true, :is-false, :is-null)</a>
<ul>
<li><a href="#org03dcf3f">:Is-True</a></li>
<li><a href="#orgc72c5f7">:Is-False</a>
<ul>
<li><a href="#org503a198">:Is-NULL</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-org1e71f97" class="outline-2">
<h2 id="org1e71f97"><a href="s-sql-examples.html">S-SQL Examples Home Page</a></h2>
<div class="outline-text-2" id="text-org1e71f97">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="s-sql-a.html">A</a></td>
<td class="org-left"><a href="s-sql-b.html">B</a></td>
<td class="org-left"><a href="s-sql-c.html">C</a></td>
<td class="org-left"><a href="s-sql-d.html">D</a></td>
<td class="org-left"><a href="s-sql-e.html">E</a></td>
<td class="org-left"><a href="s-sql-f.html">F</a></td>
<td class="org-left"><a href="s-sql-g.html">G</a></td>
<td class="org-left"><a href="s-sql-h.html">H</a></td>
<td class="org-left"><a href="s-sql-i.html">I</a></td>
<td class="org-left"><a href="s-sql-j.html">J</a></td>
<td class="org-left"><a href="s-sql-k.html">K</a></td>
<td class="org-left"><a href="s-sql-l.html">L</a></td>
<td class="org-left"><a href="s-sql-m.html">M</a></td>
<td class="org-left"><a href="s-sql-n.html">N</a></td>
<td class="org-left"><a href="s-sql-o.html">O</a></td>
<td class="org-left"><a href="s-sql-p.html">P</a></td>
<td class="org-left"><a href="s-sql-r.html">R</a></td>
<td class="org-left"><a href="s-sql-s.html">S</a></td>
<td class="org-left"><a href="s-sql-t.html">T</a></td>
<td class="org-left"><a href="s-sql-u.html">U</a></td>
<td class="org-left"><a href="s-sql-v.html">V</a></td>
<td class="org-left"><a href="s-sql-w.html">W</a></td>
<td class="org-left"><a href="s-sql-special-characters.html">Special Characters</a></td>
<td class="org-left"><a href="calling-postgresql-stored-functions.html">Calling Postgresql Stored Functions and Procedures</a></td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-between" class="outline-2">
<h2 id="between">Between</h2>
<div class="outline-text-2" id="text-between">
<div class="org-src-container">
<pre class="src src-lisp">  (query (<span class="org-builtin">:select</span> 'name
                <span class="org-builtin">:from</span> 'countries
                <span class="org-builtin">:where</span> (<span class="org-builtin">:between</span> 'latitude -10 10))
       <span class="org-builtin">:column</span>)

(<span class="org-string">"Solomon Islands"</span> <span class="org-string">"Benin"</span> <span class="org-string">"Brazil"</span> <span class="org-string">"Brunei"</span> <span class="org-string">"Cameroon"</span> <span class="org-string">"Congo"</span>  <span class="org-string">"Costa Rica"</span> <span class="org-string">"Ecuador"</span> <span class="org-string">"Ethiopia"</span> <span class="org-string">"Gabon"</span> <span class="org-string">"Ghana"</span>  <span class="org-string">"Guyana"</span> <span class="org-string">"Indonesia"</span> <span class="org-string">"Ivory Coast"</span> <span class="org-string">"Kenya"</span> <span class="org-string">"Kiribati"</span> <span class="org-string">"Liberia"</span>  <span class="org-string">"Malaysia"</span> <span class="org-string">"Maldives"</span> <span class="org-string">"Marshall Islands"</span> <span class="org-string">"Micronesia"</span> <span class="org-string">"Nauru"</span> <span class="org-string">"Nigeria"</span>  <span class="org-string">"Palau"</span> <span class="org-string">"Panama"</span> <span class="org-string">"Papua New Guinea"</span> <span class="org-string">"Peru"</span> <span class="org-string">"Rwanda"</span> <span class="org-string">"Seychelles"</span>  <span class="org-string">"Sierra Leone"</span> <span class="org-string">"Singapore"</span> <span class="org-string">"None"</span> <span class="org-string">"Sri Lanka"</span> <span class="org-string">"Suriname"</span> <span class="org-string">"Tanzania"</span>  <span class="org-string">"East Timor"</span> <span class="org-string">"Togo"</span> <span class="org-string">"Tuvalu"</span> <span class="org-string">"Uganda"</span> <span class="org-string">"Venezuela"</span> <span class="org-string">"Colombia"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-boolean" class="outline-2">
<h2 id="boolean">Boolean Operators (:is-true, :is-false, :is-null)</h2>
<div class="outline-text-2" id="text-boolean">
</div>
<div id="outline-container-org03dcf3f" class="outline-3">
<h3 id="org03dcf3f">:Is-True</h3>
<div class="outline-text-3" id="text-org03dcf3f">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> '* <span class="org-builtin">:from</span> 'boolean-test <span class="org-builtin">:where</span> (<span class="org-builtin">:is-true</span> 'a)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc72c5f7" class="outline-3">
<h3 id="orgc72c5f7">:Is-False</h3>
<div class="outline-text-3" id="text-orgc72c5f7">
<div class="org-src-container">
<pre class="src src-lisp">(sql (<span class="org-builtin">:select</span> '* <span class="org-builtin">:from</span> 'table1 <span class="org-builtin">:where</span> (<span class="org-builtin">:is-false</span> 'col)))
</pre>
</div>
</div>
<div id="outline-container-org503a198" class="outline-4">
<h4 id="org503a198">:Is-NULL</h4>
<div class="outline-text-4" id="text-org503a198">
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-builtin">:select</span> '* <span class="org-builtin">:from</span> 'table1 <span class="org-builtin">:where</span> (<span class="org-builtin">:is-false</span> 'col))
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>